org_posts/notes/2012-07-21-ggplot2.org
#+INFOJS_OPT: path:http://orgmode.org/org-info.js
#+INFOJS_OPT: toc:nil ltoc:t view:info mouse:underline buttons:nil
#+INFOJS_OPT: up:http://ericluo.github.com
#+INFOJS_OPT: home:http://ericluo.github.com
#+BEGIN_HTML
---
layout:      post
title:       ggplot2
excerpt:     
comments:    true
categories:  
  - R
---
#+END_HTML
* 什么是 =Grammer of Graphics=
[2012-07-20 五 09:10]

=Grammer of Graphics= 提供了一组正交的作图组件，这些组件可以通过不同的方式组装到一起，并且可以采用迭代式方法来作图。使用这些作图组件不仅灵活，而且简单。 

- data    :: 数据
- mapping :: 映射，即将原始数据映射到图形属性，如x,y的值，颜色取值等。
- geoms   :: 几何对象，如点、线、多边形等
- scale   :: 标度，负责映射后图形属性的显示方式，如图例和坐标刻度，其通过图例反映数据，及从图形到数据的反向映射
- stats   :: 统计变换，如对二元散点图上拟合出一条回归线
- coord   :: 坐标系，如卡迪尔坐标系
- facet   :: 分面，将数据按某种方式分组，然后分别绘图，分面就是控制分组的方法和图形的排列形式
- layer   :: 图层，将数据、映射、几何对象、统计变换等构成一个图层。图层允许用户逐步构建图形，并对单个图层进行修改。
 
* =ggplot2= 与其他的作图方法相比，主要的优点有哪些
[2012-07-20 五 09:10]

=ggplot2= 按图层进行构图，并将构图过程尽可能地与人的思维过程相一致，如第一层显示原始的数据，然后逐层向上添加备注信息或统计图表。

* =ggplot2= 作图的主要步骤是什么
[2012-07-20 五 09:12]
