_posts/notes/2012-07-21-ggplot2.html
---
layout:      post
title:       ggplot2
excerpt:     
comments:    true
categories:  
  - R
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 什么是 <code>Grammer of Graphics</code></a></li>
<li><a href="#sec-2">2 <code>ggplot2</code> 与其他的作图方法相比，主要的优点有哪些</a></li>
<li><a href="#sec-3">3 <code>ggplot2</code> 作图的主要步骤是什么</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">什么是 <code>Grammer of Graphics</code></h2>
<div class="outline-text-2" id="text-1">


<p>
<code>Grammer of Graphics</code> 提供了一组正交的作图组件，这些组件可以通过不同的方式组装到一起，并且可以采用迭代式方法来作图。使用这些作图组件不仅灵活，而且简单。 
</p>
<dl>
<dt>data   </dt><dd>数据
</dd>
<dt>mapping</dt><dd>映射，即将原始数据映射到图形属性，如x,y的值，颜色取值等。
</dd>
<dt>geoms  </dt><dd>几何对象，如点、线、多边形等
</dd>
<dt>scale  </dt><dd>标度，负责映射后图形属性的显示方式，如图例和坐标刻度，其通过图例反映数据，及从图形到数据的反向映射
</dd>
<dt>stats  </dt><dd>统计变换，如对二元散点图上拟合出一条回归线
</dd>
<dt>coord  </dt><dd>坐标系，如卡迪尔坐标系
</dd>
<dt>facet  </dt><dd>分面，将数据按某种方式分组，然后分别绘图，分面就是控制分组的方法和图形的排列形式
</dd>
<dt>layer  </dt><dd>图层，将数据、映射、几何对象、统计变换等构成一个图层。图层允许用户逐步构建图形，并对单个图层进行修改。
</dd>
</dl>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><code>ggplot2</code> 与其他的作图方法相比，主要的优点有哪些</h2>
<div class="outline-text-2" id="text-2">


<p>
<code>ggplot2</code> 按图层进行构图，并将构图过程尽可能地与人的思维过程相一致，如第一层显示原始的数据，然后逐层向上添加备注信息或统计图表。
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><code>ggplot2</code> 作图的主要步骤是什么</h2>
<div class="outline-text-2" id="text-3">

</div>
</div>
